#### Importar bibliotecas e funcionalidades

In [10]:
import pandas as pd
import os

#### Visualisando dados das planilhas

In [21]:
current_dir = os.getcwd()
parent_dir = os.path.abspath(os.path.join(current_dir, os.pardir))

path = f"{parent_dir}\\excel_data"

print("Visualisando dados")
for archive in os.listdir(path):
    if archive[:3] == "dim" or archive[:3] == "fat":
        df = pd.read_excel(f"{path}\\{archive}")
        print(f"Planilha: {archive}")
        print("Head: ")
        display(df.head())  # Mostra as primeiras linhas do DataFrame
        print("-" * 30)
        print("Info: ")
        display(df.info())  # Mostra informações sobre as colunas
        print("-" * 30)
        print("Describe: ")
        display(df.describe())  # Mostra estatísticas descritivas
        print("-" * 30)
        print(f"Nulos em {archive}: ")
        print(f"Valores nulos na(s) linha(s): ")
        display(df[df.isnull().any(axis=1)])
        print("-" * 30)

Visualisando dados
Planilha: dim_familia_produtos.xlsx
Head:

  codigo_familia descricaofamilia
0           27        Electronics
1           130          Clothing
2           FR         Home Decor
3           36               Food
4           BB              Tools

------------------------------
Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 75 entries, 0 to 74
Data columns (total 2 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   codigo_familia    75 non-null     object
 1   descricaofamilia  75 non-null     object
dtypes: object(2)
memory usage: 1.3+ KB

None

------------------------------
Describe:

       codigo_familia descricaofamilia
count              75               75
unique             75               67
top              27            Watches
freq                1                2

------------------------------
Nulos em dim_familia_produtos.xlsx:
Valores nulos na(s) linha(s):

Empty DataFrame
Columns: [codigo_familia, descricaofamilia]
Index: []

------------------------------
Planilha: dim_produtos.xlsx
Head:

,codigo_produto,descricaoproduto,codigo_familia,custo_produto_unitario
0,240900,Luxurious Outdoor Gear Teal #819,60,35.58
1,242600,Luxurious Clothing Orange #520,130,9.01
2,243800,Stylish Audiobooks White #656,33,194.99
3,245800,Delicious Bedding White #541,74,24.73
4,255200,Luxurious Construction Equipment Black #88,DFM,4.65

------------------------------
Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6975 entries, 0 to 6974
Data columns (total 4 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   codigo_produto          6975 non-null   int64
 1   descricaoproduto        6975 non-null   object
 2   codigo_familia          6975 non-null   object
 3   custo_produto_unitario  6975 non-null   float64
dtypes: float64(1), int64(1), object(2)
memory usage: 218.1+ KB

None

------------------------------
Describe:

       codigo_produto  custo_produto_unitario
count    6.975000e+03             6975.000000
mean     2.532923e+06              188.557014
std      6.107344e+05              471.699202
min      4.000000e+02                0.000000
25%      2.434127e+06               65.950000
50%      2.751600e+06              136.100000
75%      2.907004e+06              181.440000
max      3.116200e+06            10911.010000

------------------------------
Nulos em dim_produtos.xlsx:
Valores nulos na(s) linha(s):

Empty DataFrame
Columns: [codigo_produto, descricaoproduto, codigo_familia, custo_produto_unitario]
Index: []

------------------------------
Planilha: dim_vendedor.xlsx
Head:

   codigo_vendedor    nome_vendedor
0              605  Laura Carpenter
1              607    Donald Carter
2              608    Tiffany Vidal
3              618    Anthony Cozzi
4              488  Carmen Campbell

------------------------------
Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 2 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   codigo_vendedor  50 non-null     int64
 1   nome_vendedor    50 non-null     object
dtypes: int64(1), object(1)
memory usage: 932.0+ bytes

None

------------------------------
Describe:

       codigo_vendedor
count        50.000000
mean        516.260000
std          89.630263
min         243.000000
25%         475.000000
50%         528.500000
75%         588.000000
max         643.000000

------------------------------
Nulos em dim_vendedor.xlsx:
Valores nulos na(s) linha(s):

Empty DataFrame
Columns: [codigo_vendedor, nome_vendedor]
Index: []

------------------------------
Planilha: fato_vendas.xlsx
Head:

,codigo_contrato,data_venda,codigo_produto,filial_venda,quantidade,valor_monetario_total,valor_desconto,codigo_vendedor,codigo_cliente
0,2280272,2021-03-29,2792100,17,250,29975.0,0.0,548,574535.0
1,2356833,2021-06-07,1657700,17,300,29370.0,0.0,548,574535.0
2,2341483,2021-05-21,2820500,16,3072,18124.8,0.0,498,665092.0
3,3112065,2023-12-27,3056100,1,1,16800.0,-690.0,546,862324.0
4,2605310,2022-02-14,2917300,17,1,15990.8,0.0,507,157656.0

------------------------------
Info:
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 519849 entries, 0 to 519848
Data columns (total 9 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   codigo_contrato        519849 non-null  object
 1   data_venda             519849 non-null  datetime64[ns]
 2   codigo_produto         519849 non-null  int64
 3   filial_venda           519849 non-null  int64
 4   quantidade             519849 non-null  int64
 5   valor_monetario_total  519849 non-null  float64
 6   valor_desconto         519849 non-null  float64
 7   codigo_vendedor        519849 non-null  int64
 8   codigo_cliente         519844 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(4), object(1)
memory usage: 35.7+ MB

None

------------------------------
Describe:

,data_venda,codigo_produto,filial_venda,quantidade,valor_monetario_total,valor_desconto,codigo_vendedor,codigo_cliente
count,519849,5.198490e+05,519849.000000,519849.000000,519849.000000,519849.000000,519849.000000,519844.000000
mean,2022-06-29 17:34:02.229186304,1.976492e+06,12.111663,5.791759,128.981814,-0.635384,513.913927,399205.494248
min,2021-02-01 00:00:00,4.000000e+02,1.000000,1.000000,0.000000,-1100.000000,243.000000,3.000000
25%,2021-10-15 00:00:00,1.067600e+06,10.000000,1.000000,21.800000,0.000000,478.000000,118616.000000
50%,2022-06-06 00:00:00,2.359626e+06,14.000000,1.000000,49.500000,0.000000,528.000000,322263.000000
75%,2023-03-11 00:00:00,2.767200e+06,16.000000,2.000000,145.000000,0.000000,563.000000,705951.000000
max,2024-01-31 00:00:00,3.116200e+06,17.000000,4000.000000,29975.000000,0.000000,643.000000,866163.000000
std,NaN,9.234151e+05,4.910249,29.115692,325.509930,5.453049,83.589557,296841.869133

------------------------------
Nulos em fato_vendas.xlsx:
Valores nulos na(s) linha(s):

,codigo_contrato,data_venda,codigo_produto,filial_venda,quantidade,valor_monetario_total,valor_desconto,codigo_vendedor,codigo_cliente
51030,NF 5954,2024-01-15,2922426,17,1,322.9,0.0,589,NaN
91288,NF 5954,2024-01-15,1003800,17,1,225.0,0.0,589,NaN
174116,NF 4888,2023-11-13,1148400,16,2,94.0,0.0,640,NaN
329443,NF 790,2023-09-12,2820700,16,1,31.8,0.0,640,NaN
380807,NF 111897,2022-01-19,2730100,17,1,22.9,0.0,438,NaN

------------------------------

#### Organizando e limpando dados

In [ ]:
print("Limpando dados")
for archive in os.listdir(parent_dir):
    if archive[:3] == "dim" or archive[:3] == "fat":
        df = pd.read_excel(f"{parent_dir}/{archive}")
        df_cleaned = df.drop_duplicates().fillna(0).applymap(lambda x: x.strip() if isinstance(x, str) else x)
        df_cleaned.to_excel(f"{parent_dir}/clean_{archive}", index=False)